Revit 2027 API
BuiltInFailures.ElementTypeFailures.WarnLastType1 Property
 Last type in system family '[Name]' cannot be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WarnLastType1 { get; }
Public Shared ReadOnly Property WarnLastType1 As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WarnLastType1 {
	FailureDefinitionId^ get ();
}
static member WarnLastType1 : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElementTypeFailures Class
Autodesk.Revit.DB Namespace